Revit 2024 API
HomeCamera.Pivot Property
 The pivot point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ Pivot { get; }
Visual Basic
Public ReadOnly Property Pivot As XYZ
	Get
Visual C++
public:
property XYZ^ Pivot {
	XYZ^ get ();
}
See Also
HomeCamera Class
Autodesk.Revit.DB Namespace